# Task#1:

## Pandas

The following exercises will help you practice key functions using the pandas library.

### Question 1: import the pandas library

In [1]:
##Your code here
import pandas as pd

### Question 2: 

Import the `exercises.csv` file in a pandas DataFrame

In [ ]:
##Your code here

In [11]:
df = pd.read_csv('C:\\Users\\daivi\\Desktop\\AML 1114 - Data science and machine learning\\Code and Datasets\\WEEK 3\\exercises.csv')

In [12]:
df.head()

,Gender,City,Income,Occupation,Marital_Status,Fixed_Monthly_Expenses
0,Male,London,40400,Teacher,Single,2080
1,Female,Vancouver,62845,University Lecturer,Married,2927
2,Female,Montreal,66439,Analyst,Single,2811
3,Female,Winnipeg,101547,Marketing Manager,Common Law,3500
4,Male,Calgary,46424,Analyst,Single,1300

### Question 3:

Answer the following questions using the info(), describe(), groupby(), count(), mean(), corr(), sort_values() and agg() functions:

* 1. How many observations are there? 
* 2. What data types does the data set have?  
* 3. What is the average income in this data set? 
* 4. What is the average monthly expenses in this dataset? 
* 5. What is the average income by city in this dataset?
* 6. Which city has the most observations? 
* 7. Which occupation has the most observations?
* 8. What is the average income by occupation?
* 9. What is the average monthly expenses by occupation?
* 10. What is the average income and monthly expenses by Marital Status?
* 11. Which people are most likely to have a high income, based on gender, occupation, city, or marital status?
* 12. What conclusions can you make about Toronto women's income and expenses?
* 13. Which city has the highest income?
* 14. Calculate the correlation between income and expenses.

In [90]:
# 1. How many observations are there?
df.shape

(27, 6)

### There are 27 records (rows) and 6 features (columns)

In [92]:
#2. What data types does the data set have? 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Gender                  27 non-null     object
 1   City                    27 non-null     object
 2   Income                  27 non-null     int64
 3   Occupation              27 non-null     object
 4   Marital_Status          27 non-null     object
 5   Fixed_Monthly_Expenses  27 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.4+ KB

### There are 2 types of datatypes in the dataset: Object, Integer

In [14]:
df.describe()

              Income  Fixed_Monthly_Expenses
count      27.000000               27.000000
mean    74176.777778             2508.000000
std     23069.479500             1063.438617
min     40400.000000             1078.000000
25%     59795.500000             1605.000000
50%     66439.000000             2378.000000
75%     86943.500000             2957.000000
max    123891.000000             4988.000000

In [47]:
# 5. What is the average income by city in this dataset?
df.groupby('City') ['Income'].mean()

City
Calgary      75908.166667
London       61860.200000
Montreal     58394.000000
Toronto      89115.428571
Vancouver    62845.000000
Winnipeg     75237.600000
Name: Income, dtype: float64

 The average income by cities is as shown

In [53]:
# 6.Which city has the most observations?
df['City'].value_counts()

City
Toronto      7
Calgary      6
London       5
Winnipeg     5
Montreal     3
Vancouver    1
Name: count, dtype: int64

In [87]:
df['City'] [df['City'] == df['City'].mode()[0]].value_counts()

City
Toronto    7
Name: count, dtype: int64

In [54]:
# 7. Which occupation has the most observations?
df['Occupation'].value_counts()

Occupation
Researcher                  5
Analyst                     3
Professor                   3
Teacher                     2
Engineer                    2
Customer Service Manager    2
University Lecturer         1
Marketing Manager           1
Real Estate Agent           1
Account Executive           1
Account Manager             1
Marketing Analyst           1
Operations Director         1
Investment Banker           1
Associate Professor         1
Finance Executive           1
Name: count, dtype: int64

In [88]:
df['Occupation'] [df['Occupation'] == df['Occupation'].mode()[0]].value_counts()

Occupation
Researcher    5
Name: count, dtype: int64

In [58]:
# 8. What is the average income by occupation
df.groupby('Occupation') ['Income'].mean()

Occupation
Account Executive            86825.000000
Account Manager              61500.000000
Analyst                      57410.666667
Associate Professor          78712.000000
Customer Service Manager     48429.500000
Engineer                     86339.500000
Finance Executive           123771.000000
Investment Banker           107673.000000
Marketing Analyst            64145.000000
Marketing Manager           101547.000000
Operations Director         123891.000000
Professor                    89204.000000
Real Estate Agent            70443.000000
Researcher                   60506.000000
Teacher                      54754.500000
University Lecturer          62845.000000
Name: Income, dtype: float64

The average income by occupation is as shown

In [59]:
# 9. What is the average monthly expenses by occupation?
df.groupby('Occupation') ['Fixed_Monthly_Expenses'].mean()

Occupation
Account Executive           2378.000000
Account Manager             1200.000000
Analyst                     1729.666667
Associate Professor         2898.000000
Customer Service Manager    1295.000000
Engineer                    3218.000000
Finance Executive           4988.000000
Investment Banker           3876.000000
Marketing Analyst           2400.000000
Marketing Manager           3500.000000
Operations Director         4398.000000
Professor                   2599.666667
Real Estate Agent           2181.000000
Researcher                  1977.800000
Teacher                     2533.500000
University Lecturer         2927.000000
Name: Fixed_Monthly_Expenses, dtype: float64

In [60]:
# 10. What is the average income and monthly expenses by Marital Status?
df.groupby('Marital_Status') [['Income', 'Fixed_Monthly_Expenses']].mean()

                      Income  Fixed_Monthly_Expenses
Marital_Status
Common Law      81198.888889             2816.555556
Married         82947.875000             3243.000000
Single          60840.000000             1642.300000

The average income and monthly expenses by marital status is as shown, Average Income is higher for Married People than Single People, similarly the average expense is greater

In [61]:
df.head()

,Gender,City,Income,Occupation,Marital_Status,Fixed_Monthly_Expenses
0,Male,London,40400,Teacher,Single,2080
1,Female,Vancouver,62845,University Lecturer,Married,2927
2,Female,Montreal,66439,Analyst,Single,2811
3,Female,Winnipeg,101547,Marketing Manager,Common Law,3500
4,Male,Calgary,46424,Analyst,Single,1300

In [69]:
# 11. Which people are most likely to have a high income, based on gender, occupation, city, or marital status?
df.groupby(['Gender', 'Occupation', 'City', 'Marital_Status']) ['Income'].mean()

Gender         Occupation                City       Marital_Status
Female         Account Executive         Calgary    Single             86825.0
               Analyst                   Montreal   Single             66439.0
               Customer Service Manager  Montreal   Single             49374.0
               Engineer                  Calgary    Married           106505.0
               Investment Banker         Winnipeg   Common Law        107673.0
               Marketing Manager         Winnipeg   Common Law        101547.0
               Researcher                London     Married            54759.0
               Teacher                   Toronto    Married            69109.0
               University Lecturer       Vancouver  Married            62845.0
Male           Account Manager           Winnipeg   Single             61500.0
               Analyst                   Calgary    Single             46424.0
               Associate Professor       Toronto    Common Law         78712.0
               Customer Service Manager  Winnipeg   Single             47485.0
               Marketing Analyst         Toronto    Common Law         64145.0
               Operations Director       Toronto    Common Law        123891.0
               Professor                 Calgary    Married            87062.0
                                         London     Single             83477.0
                                         Toronto    Married            97073.0
               Real Estate Agent         London     Common Law         70443.0
               Researcher                Calgary    Married            62459.0
                                         Toronto    Single             67107.0
               Teacher                   London     Single             40400.0
Not Specified  Analyst                   Montreal   Single             59369.0
               Engineer                  Calgary    Common Law         66174.0
               Finance Executive         Toronto    Married           123771.0
               Researcher                London     Common Law         60222.0
                                         Winnipeg   Common Law         57983.0
Name: Income, dtype: float64

In [95]:
df.groupby('Gender') ['Income'].mean()

Gender
Female           78341.777778
Male             71552.153846
Not Specified    73503.800000
Name: Income, dtype: float64

In [96]:
df.groupby('Gender') ['Income'].mean().idxmax()

'Female'

In [71]:
df.groupby('Occupation') ['Income'].mean()

Occupation
Account Executive            86825.000000
Account Manager              61500.000000
Analyst                      57410.666667
Associate Professor          78712.000000
Customer Service Manager     48429.500000
Engineer                     86339.500000
Finance Executive           123771.000000
Investment Banker           107673.000000
Marketing Analyst            64145.000000
Marketing Manager           101547.000000
Operations Director         123891.000000
Professor                    89204.000000
Real Estate Agent            70443.000000
Researcher                   60506.000000
Teacher                      54754.500000
University Lecturer          62845.000000
Name: Income, dtype: float64

In [97]:
df.groupby('Occupation') ['Income'].mean().idxmax()

'Operations Director'

In [72]:
df.groupby('City') ['Income'].mean()

City
Calgary      75908.166667
London       61860.200000
Montreal     58394.000000
Toronto      89115.428571
Vancouver    62845.000000
Winnipeg     75237.600000
Name: Income, dtype: float64

In [102]:
df.groupby('City') ['Income'].mean().idxmax()

'Toronto'

In [73]:
df.groupby('Marital_Status') ['Income'].mean()

Marital_Status
Common Law    81198.888889
Married       82947.875000
Single        60840.000000
Name: Income, dtype: float64

In [107]:
# 11. Which people are most likely to have a high income, based on gender, occupation, city, or marital status?
print(f"{df.groupby('Gender') ['Income'].mean().idxmax()} have a Higher average Income")
print(f"The occupation with the highest average income is {df.groupby('Occupation') ['Income'].mean().idxmax() }")
print(f"The city with the highest average income is {df.groupby('City')['Income'].mean().idxmax() }")
print(f"{df.groupby('Marital_Status') ['Income'].mean().idxmax()} People have a higher average income")

Female have a Higher average Income
The occupation with the highest average income is Operations Director
The city with the highest average income is Toronto
Married People have a higher average income

Female have a Higher average Income <br>
The occupation with the highest average income is Operations Director <br>
The city with the highest average income is Toronto <br>
Married People have a higher average income <br>

In [75]:
# 12. What conclusions can you make about Toronto women's income and expenses?
df[df['Gender'] == 'Female'] [['Income', 'Fixed_Monthly_Expenses']].mean()
# The average income for women is 78341.78 while their average monthly expenses are 2881.22

Income                    78341.777778
Fixed_Monthly_Expenses     2881.222222
dtype: float64

In [76]:
df[df['Gender'] == 'Female'] [['Income', 'Fixed_Monthly_Expenses']]

    Income  Fixed_Monthly_Expenses
1    62845                    2927
2    66439                    2811
3   101547                    3500
8    54759                    2065
10  106505                    4000
13   86825                    2378
17  107673                    3876
18   69109                    2987
25   49374                    1387

In [80]:
#13. Which city has the highest income?
df.groupby('City') ['Income'].max()

City
Calgary      106505
London        83477
Montreal      66439
Toronto      123891
Vancouver     62845
Winnipeg     107673
Name: Income, dtype: int64

In [81]:
#14. Calculate the correlation between income and expenses.
df[['Income', 'Fixed_Monthly_Expenses']].corr()

                          Income  Fixed_Monthly_Expenses
Income                  1.000000                0.843101
Fixed_Monthly_Expenses  0.843101                1.000000